# ДЗ 2.1. Виведення числа в стовпчик // Написати програму, яка просить користувача ввести 4-х значне число з клавіатури,
# після чого друкує на екрані стовпчик цифр, з якого це число складається

# num = int(input())

# a = num // 1000
# b = num % 1000 // 100
# c = num % 100 // 10
# d = num % 10

# print(a)
# print(b)
# print(c)
# print(d)


# ДЗ 2.2. Необхідно "перевернути" 5-ти значне число

n = int(input())

a = n // 10_000
b = n % 10_000 // 1000
c = n % 1000 // 100
d = n % 100 // 10
e = n % 10

print(e, d, c, b, a, sep='')
